In [1]:
#filepath = r'/Users/tianyisun/Desktop/NLQbatches/nlqueryof3models/tsp-nlquery.txt'
#m1_nlq = pd.read_csv(filepath, sep='delimiter', header=None)
#m1_nlq.to_csv(r'/Users/tianyisun/Desktop/NLQbatches/nlqueryof3models/tsp-nlquery.csv', index=None)

---

In [283]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt 
from textwrap import wrap
import re
import seaborn as sns
from pandas import DataFrame
import math 

import os
for dirname, _, filenames in os.walk('/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_category_Krippendroffis_alpha.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_proc1.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_sql-type_Krippendroffis_alpha.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/annotation_feedback_batch5.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_category_results.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_sql-category_Krippendroffis_alpha.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_type_stability.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_sql-type_Fleiss_kappa.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_annotationtask_sql_type.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/13annotation_feedback_batch5.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_category_Fleiss_kappa.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_agreements.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_annotationtask_sql_errorcategory.csv
/Users/tianyisun/Desktop/NLQbatches/batch5/batch5_round1/batch5_category_stability.csv

In [120]:
b1r2 = '/Users/tianyisun/Desktop/NLQbatches/batch1/batch1_round2/revise1_ning_tian.csv'
b1r2 = pd.read_csv(b1r2)
b1r1 = '/Users/tianyisun/Desktop/NLQbatches/batch1/batch1_round1/First-round error type annotation.csv'
b1r1 = pd.read_csv(b1r1)
#b1r2.sql_id

nlq1 = '/Users/tianyisun/Desktop/NLQbatches/nlqueryof3models/smbop-nlquery.csv'
nlq1 = pd.read_csv(nlq1)

len(b1r1[['sql_id', 'nl_query']].value_counts().index.values)

mg1 = pd.merge(b1r1[['sql', 'nl_query']], b1r2, on = 'sql', how = 'left') 
len(mg1['nl_query'].value_counts().index.values)


for i in mg1[mg1.duplicated() == True].index:
    mg1 = mg1.drop(i)

#mg1.to_csv('/Users/tianyisun/Desktop/NLQbatches/batch1/batch1_round2.csv', index = True)

In [121]:
len(mg1)

47

In [85]:
b2r1 = '/Users/tianyisun/Desktop/NLQbatches/batch2/batch2_round1/annotation_feedback_batch2.csv'
b2r1 = pd.read_csv(b2r1)
b2r2 = '/Users/tianyisun/Desktop/NLQbatches/batch2/batch2_round2/revise2_ning_tian.csv'
b2r2 = pd.read_csv(b2r2)
#len(b2r2['nl_query'].value_counts().index.values)
mg2 = pd.merge(b2r1[['sql', 'nl_query']], b2r2, on = 'sql', how = 'outer') 
len(mg2['nl_query'].value_counts().index.values)

for i in mg2[mg2.nl_query.duplicated() == True].index:
    mg2 = mg2.drop(i)
#mg2.to_csv('/Users/tianyisun/Desktop/NLQbatches/batch2/batch2_round2.csv', index = True)

46

In [104]:
b3r2 ='/Users/tianyisun/Desktop/NLQbatches/batch3/batch3_round2/revise3_ning_tian.csv'
b3r2 = pd.read_csv(b3r2)
b3r1 = '/Users/tianyisun/Desktop/NLQbatches/batch3/batch3_round1/annotation_feedback_batch3.csv'
b3r1 = pd.read_csv(b3r1)

#len(b3r1['nl_query'].value_counts().index.values)
mg3 = pd.merge(b3r1[['sql', 'nl_query']], b3r2, on = 'sql', how = 'outer') 
len(mg3['nl_query'].value_counts().index.values)
for i in mg3[mg3.nl_query.duplicated() == True].index:
    mg3 = mg3.drop(i)
#mg3.to_csv('/Users/tianyisun/Desktop/NLQbatches/batch3/batch3_round2.csv', index = True)

In [462]:
b4r1 = '/Users/tianyisun/Desktop/NLQbatches/smbop/batch4/batch4_round1/annotation_feedback_batch4 2.csv'
b4r1 = pd.read_csv(b4r1)
b4r2 ='/Users/tianyisun/Desktop/NLQbatches/smbop/batch4/batch4_round2/correct_batch4.csv'
b4r2 = pd.read_csv(b4r2)
b4r2f = '/Users/tianyisun/Desktop/NLQbatches/smbop/batch4/batch4_round2/correct_batch4_final.csv'
b4r2f = pd.read_csv(b4r2f)
b4r2 = b4r2.rename(columns={"error_classification_x": "tianyi_code", "error_classification_y": "zhengn_code"})

In [463]:
for i in b4r1[b4r1.nl_query.duplicated() == True].index:
    b4r1 = b4r1.drop(i)
    
len(b4r1)

313

In [467]:
b4r2 = b4r2[['nl_query', 'sql', 'GT_sql', 'tianyi', 'tianyi_code', 'zhengn', 'zhengn_code' ]]

In [469]:
b4r2f = b4r2f[['nl_query', 'sql', 'GT_sql', 'tianyi', 'tianyi_code', 'zhengn', 'zhengn_code' ]]

In [470]:
mg4 = b4r2.loc[~b4r2['nl_query'].isin(b4r2f['nl_query'])].append(b4r2f)

In [479]:
mg4.head(0)

Empty DataFrame
Columns: [nl_query, sql, GT_sql, tianyi, tianyi_code, zhengn, zhengn_code]
Index: []

In [475]:
b4r1 = pd.merge(b4r1[b4r1.username == 'tianyi'][[ 'sql', 'nl_query', 'GT_sql','username', 'error_classification']],
                b4r1[b4r1.username == 'zhengning'][[ 'sql', 'nl_query', 'GT_sql','username', 'error_classification']],
                on = ['sql', 'nl_query', 'GT_sql'],
                how = 'outer')

In [478]:

b4r1 = b4r1.rename(columns={"username_y": "zhengn", "username_x": "tianyi", "error_classification_x": "tianyi_code", "error_classification_y": "zhengn_code"})
b4r1.head(1)

,sql,nl_query,GT_sql,tianyi,tianyi_code,zhengn,zhengn_code
0,SELECT customers.customer_name FROM customers ...,Which customers made orders between 2009-01-01...,SELECT T1.customer_name FROM customers AS T1 J...,tianyi,"F1, F2",NaN,NaN

In [480]:
mg4f = b4r1.loc[~b4r1['nl_query'].isin(mg4['nl_query'])].append(mg4)

In [491]:
len(b4r1.nl_query.value_counts().index.values)

313

In [493]:
mg4f = pd.read_csv('/Users/tianyisun/Desktop/NLQbatches/smbop/batch4/batch4_round2.csv')

In [511]:
mg4f[['sql', 'nl_query', 'GT_sql', 'tianyi', 'tianyi_code','zhengn', 'zhengn_code']]

,sql,nl_query,GT_sql,tianyi,tianyi_code,zhengn,zhengn_code
0,"SELECT station.name , station.location FROM st...",List the names and locations of all stations o...,"SELECT name , LOCATION FROM station ORDER BY ...",tianyi,K3,zhengning,K3
1,"SELECT student.major , AVG( student.age ) , MI...","Show the average, minimum, and maximum age for...","SELECT major , avg(age) , min(age) , max(ag...",tianyi,L5,zhengning,L5
2,SELECT physician.name FROM physician WHERE phy...,List the name of physicians who never took any...,SELECT name FROM physician EXCEPT SELECT T2.na...,tianyi,NaN,zhengning,NaN
3,"SELECT journalist.name , event.name FROM news_...",Show the names of journalists and the names of...,"SELECT T3.Name , T2.Name FROM news_report AS ...",tianyi,K3,zhengning,K3
4,SELECT projects.project_details FROM projects ...,What are the details of the project with no ou...,SELECT project_details FROM Projects WHERE pro...,tianyi,NaN,zhengning,NaN
...,...,...,...,...,...,...,...
308,SELECT university.founded FROM university WHER...,Find the founded year of the newest non public...,SELECT founded FROM university WHERE affiliati...,tianyi,"D1a, K2",zhengning,"K2, D1a"
309,SELECT organisations.organisation_details FROM...,What are the details of all organizations that...,SELECT organisation_details FROM Organisations...,tianyi,"CE2, D1b",zhengning,"D1c, CE2"
310,SELECT MAX( postseason.league_id_loser ) FROM ...,List the maximum scores of the team Boston Red...,SELECT max(T1.wins) FROM postseason AS T1 JOIN...,tianyi,"BL1, BE5",zhengning,"BL1, BE5"
311,"SELECT statements.statement_details , document...",Show the statement detail and the correspondin...,"SELECT T1.statement_details , T2.document_nam...",tianyi,"BF4, CF5",zhengning,CF5
312,"SELECT car_makers.fullname , COUNT( * ) FROM m...","What is the full name of each car maker, along...",NaN,NaN,NaN,NaN,NaN

In [525]:
#mg3.columns[['sql', 'nl_query', 'GT_sql', 'tianyi', 'tianyi_code','zhengn', 'zhengn_code']]
mg3 = mg3.rename(columns={"coder": "zhengn", "username": "tianyi", "code_tianyi": "tianyi_code", "code_ning": "zhengn_code"})
mg3 = mg3[['sql', 'nl_query', 'GT_sql', 'tianyi', 'tianyi_code','zhengn', 'zhengn_code']]

In [513]:
mg2 = pd.read_csv('/Users/tianyisun/Desktop/NLQbatches/smbop/batch2/batch2_round2.csv')

In [526]:
mg2 = mg2.rename(columns={"coder": "zhengn", "username": "tianyi", "error_classification": "tianyi_code"})
mg2 = mg2[['sql', 'nl_query', 'GT_sql', 'tianyi', 'tianyi_code','zhengn', 'zhengn_code']]

In [527]:
#mg1 = mg1.rename(columns={"coder": "zhengn", "coder_tianyi": "tianyi", "code_tianyi": "tianyi_code", "code_ning":"zhengn_code"})
mg1 = mg1[['sql', 'nl_query', 'GT_sql', 'tianyi', 'tianyi_code','zhengn', 'zhengn_code']]

In [528]:
md1 = mg4f.append(mg3).append(mg2).append(mg1)

In [529]:
md1

,Unnamed: 0,sql,nl_query,GT_sql,tianyi,tianyi_code,zhengn,zhengn_code
0,18.0,"SELECT station.name , station.location FROM st...",List the names and locations of all stations o...,"SELECT name , LOCATION FROM station ORDER BY ...",tianyi,K3,zhengning,K3
1,26.0,"SELECT student.major , AVG( student.age ) , MI...","Show the average, minimum, and maximum age for...","SELECT major , avg(age) , min(age) , max(ag...",tianyi,L5,zhengning,L5
2,33.0,SELECT physician.name FROM physician WHERE phy...,List the name of physicians who never took any...,SELECT name FROM physician EXCEPT SELECT T2.na...,tianyi,NaN,zhengning,NaN
3,48.0,"SELECT journalist.name , event.name FROM news_...",Show the names of journalists and the names of...,"SELECT T3.Name , T2.Name FROM news_report AS ...",tianyi,K3,zhengning,K3
4,54.0,SELECT projects.project_details FROM projects ...,What are the details of the project with no ou...,SELECT project_details FROM Projects WHERE pro...,tianyi,NaN,zhengning,NaN
...,...,...,...,...,...,...,...,...
671,NaN,"SELECT physician.name , physician.position FRO...",Find the name and position of physicians who p...,"SELECT DISTINCT T1.name , T1.position FROM phy...",Tianyi,CE2; A1b,zhengning,"A1b, CE2"
687,NaN,SELECT dorm.dorm_name FROM dorm WHERE dorm.gen...,Find the name of dorms only for female (F gend...,SELECT dorm_name FROM dorm WHERE gender = 'F',Tianyi,D1a,zhengning,D1a
703,NaN,"SELECT COUNT( * ) , block.blockcode FROM block...",How many rooms are located for each block code?,"SELECT count(*) , T1.blockcode FROM BLOCK AS T...",Tianyi,BE5,zhengning,BE5
719,NaN,"SELECT statements.statement_details , document...",What are the details for statements with the d...,NaN,NaN,NaN,NaN,NaN
731,NaN,SELECT sportsinfo.stuid FROM sportsinfo WHERE ...,What are the ids for all sporty students who a...,NaN,NaN,NaN,NaN,NaN

In [530]:
md1.to_csv('/Users/tianyisun/Desktop/NLQbatches/smbop/smbop_round2.csv', index = True)

---

In [347]:
path1b5 = '/Users/tianyisun/Desktop/NLQbatches/tsp/batch5/batch5_round1/annotation_feedback_batch5.csv'

pathb5 = '/Users/tianyisun/Desktop/NLQbatches/tsp/batch5/batch5_round2/correct_batch5_final.csv'
pathb6 ='/Users/tianyisun/Desktop/NLQbatches/tsp/batch6/batch6_round2/correct_batch6_final.csv'
nlq2 = '/Users/tianyisun/Desktop/NLQbatches/nlqueryof3models/tsp-nlquery.csv'

b15 = pd.read_csv(path1b5)
b5 = pd.read_csv(pathb5)
b6 = pd.read_csv(pathb6)
nlq2 = pd.read_csv(nlq2)

batch5nlq = b15['nl_query'].value_counts().index.values
len(batch5nlq)

849

In [348]:
md2 = b5.append(b6)
len(md2['nl_query'].value_counts().index.values)
len(md2)

851

In [331]:
md2

,Unnamed: 0,Unnamed: 0.1,sql_id,nl_query,sql,GT_sql,tianyi_code,zhengn_code
0,0,0,746,Of all players with an overall rating greater ...,SELECT COUNT(*) FROM Player_Attributes WHERE P...,"SELECT preferred_foot , count(*) FROM Player_...","BL1, F3, F4, AN2, CE2","BL1, F3, BL3, AN2, CE2"
1,1,1,1088,Find the number of rooms for different block c...,"SELECT Block.BlockCode, COUNT(*) FROM Block JO...","SELECT count(*) , T1.blockcode FROM BLOCK AS ...","BL1, F3, BE5, AN2, CE2","CE2, F3, BL3, AN2"
2,2,2,1317,"For the problem with id 10, return the ids and...","SELECT Problem_Log.problem_id, Problems.date_p...","SELECT problem_log_id , log_entry_date FROM p...","BL1, E1, BE5, BF4","BL1, E1, CE2"
3,3,3,548,How many lessons have been cancelled?,SELECT COUNT(*) FROM Lessons WHERE Lessons.les...,SELECT count(*) FROM Lessons WHERE lesson_stat...,"BL1, E1, BF4, D1a","BL1, E1, D1a"
4,4,4,159,List all people names in the order of their da...,SELECT people.Name FROM people ORDER BY people...,SELECT name FROM people ORDER BY date_of_birth,"K2, D1a","K2, D1a"
...,...,...,...,...,...,...,...,...
708,708,708,2270,Find the name of the employee who got the high...,SELECT employee.Name FROM evaluation JOIN empl...,SELECT t1.name FROM employee AS t1 JOIN evalua...,"L4, N3","N3, L4"
709,709,709,2283,What are the countries that are not playing ca...,SELECT DISTINCT Cartoon.Title FROM Cartoon EXC...,SELECT country FROM TV_Channel EXCEPT SELECT T...,"CE2, CL1, A2a","CL1, CE2, A2a"
710,710,710,2285,What are the ids of the TV channels that do no...,SELECT TV_Channel.id FROM TV_Channel EXCEPT SE...,SELECT id FROM TV_Channel EXCEPT SELECT channe...,BL1,BL1
711,711,711,2286,find the package option of the tv channel that...,SELECT TV_Channel.Package_Option FROM TV_Chann...,SELECT package_option FROM TV_Channel WHERE id...,"E1, A1d, A1a","E1, A2c"
712,712,712,2287,What are the package options of all tv channel...,SELECT TV_Channel.Package_Option FROM TV_Chann...,SELECT package_option FROM TV_Channel WHERE id...,"E1, A1d, A1a","E1, A2c"

In [324]:
for i in md2[md2.nl_query.duplicated() == True].index:
    md2 = md2.drop(i)

In [352]:
len(md2)
#md2[md2.nl_query.duplicated() == True]
#md2 = md2.drop(0)

849

In [353]:
#md2.to_csv('/Users/tianyisun/Desktop/NLQbatches/tsp/tsp_round2.csv', index = True)

---

In [450]:
nlq3 = '/Users/tianyisun/Desktop/NLQbatches/nlqueryof3models/gazp-nlquery.csv'
#path17 ='/Users/tianyisun/Desktop/NLQbatches/batch7/batch7_round1/annotation_feedback_batch7.csv'
path17 ='/Users/tianyisun/Desktop/NLQbatches/gazp/batch7/batch7_round1/updated_annotation_feedback_batch7.csv'
pathb7 = '/Users/tianyisun/Desktop/NLQbatches/gazp/batch7/batch7_round2/correct_batch7_final.csv'

b17 = pd.read_csv(path17)
b17 = b17.rename(columns={"error_classification_x": "tianyi_code", "error_classification_y": "zhengn_code"})
b27 = pd.read_csv(pathb7)

nlq3 = pd.read_csv(nlq3)

In [451]:
btc7 = pd.merge(b17[b17.username == 'tianyi'][[ 'sql', 'nl_query', 'GT_sql','username', 'error_classification']],
                b17[b17.username == 'zhengning'][[ 'sql', 'nl_query', 'GT_sql','username', 'error_classification']],
                on = ['sql', 'nl_query', 'GT_sql'],
                how = 'outer')

In [452]:
btc7 = btc7.rename(columns={"username_y": "zhengning", "username_x": "tianyi", "error_classification_x": "tianyi_code", "error_classification_y": "zhengn_code"})

In [454]:
len(mg7['nl_query'].value_counts().index.values)

431

In [456]:
for i in mg7[mg7.nl_query.duplicated() == True].index:
    mg7 = mg7.drop(i)

In [457]:
mg7 = btc7.loc[~btc7['nl_query'].isin(b27['nl_query'])].append(b27)

In [458]:
len(mg7)

432

In [459]:
mg7.to_csv('/Users/tianyisun/Desktop/NLQbatches/gazp/batch7/batch7_round2.csv', index = True)

In [192]:
dfb5 = pd.DataFrame(batch5nlq)
dfb6 = pd.DataFrame(batch6nlq)
dfb7 = pd.DataFrame(batch7nlq)

In [250]:

len(dfb7)

398

In [247]:
nlq2[nlq2['0'].duplicated() == True]
#nlq2 = nlq2.drop(351)
#nlq2.to_csv(r'/Users/tianyisun/Desktop/NLQbatches/nlqueryof3models/tsp-nlquery.csv', index=None)
len(nlq2)

849

In [239]:
f = pd.merge(nlq2['0'], dfb5[0], left_on = '0',  right_on = 0, how = 'inner')

In [240]:
len(f)

850

In [248]:
d = pd.merge(dfb6,dfb5, left_index = True, right_index = True, how= "outer")
len(d)

849

In [249]:
d

,0_x,0_y
0,"Return the maximum support rate, minimum consi...",What are the last names for all scholarship st...
1,How many different students are involved in sp...,How many friends does Dan have?
2,What are all role codes?,How many cities are there that have more than ...
3,What are the names of the songs that are moder...,Find the number of concerts happened in the st...
4,What is the name of the shipping agent of the ...,How many models does each car maker produce? L...
...,...,...
844,NaN,List the names of all genres in alphabetical o...
845,NaN,Find the number of distinct amenities.
846,NaN,Return the low and high estimates for all film...
847,NaN,What are the names for the 3 branches that hav...
848,NaN,Find the names of the students who are in the ...

In [174]:
len(nlq3)

1064

In [31]:
# for model1 complete sqls
nlq2 = '/Users/tianyisun/Desktop/NLQbatches/nlqueryof3models/tsp-nlquery.csv'
pathb1 = '/Users/tianyisun/Desktop/NLQbatches/batch1/batch1_round2/revise1_ning_tian.csv'
pathb2 = '/Users/tianyisun/Desktop/NLQbatches/batch2/batch2_round2/revise2_ning_tian.csv'
pathb3 = '/Users/tianyisun/Desktop/NLQbatches/batch3/batch3_round2/revise3_ning_tian.csv'
pathb4 = '/Users/tianyisun/Desktop/NLQbatches/batch4/batch4_round2/correct_batch4.csv'

b1 = pd.read_csv(pathb1)
nlq1 = pd.read_csv('/Users/tianyisun/Desktop/NLQbatches/nlqueryof3models/smbop-nlquery.csv')

In [42]:
p = '/Users/tianyisun/Desktop/NLQbatches/batch1/batch1_round1/First-round error type annotation.csv'
p = pd.read_csv(p)
batch1nlq = p['nl_query'].value_counts().index.values[:-1]

In [43]:
len(batch1nlq)

46

---

In [44]:
p2 = '/Users/tianyisun/Desktop/NLQbatches/batch2/batch2_round1/annotation_feedback_batch2.csv'
p2 = pd.read_csv(p2)
batch2nlq = p2['nl_query'].value_counts().index.values
#p2['nl_query'].value_counts()
len(batch2nlq)

46

---

In [46]:
p3 = '/Users/tianyisun/Desktop/NLQbatches/batch3/batch3_round1/annotation_feedback_batch3.csv'
p3 = pd.read_csv(p3)
batch3nlq = p3['nl_query'].value_counts().index.values
#p2['nl_query'].value_counts()
len(batch3nlq)

46

---

In [47]:
p4 = '/Users/tianyisun/Desktop/NLQbatches/batch4/batch4_round1/annotation_feedback_batch4.csv'
p4 = pd.read_csv(p4)
batch4nlq = p4['nl_query'].value_counts().index.values
#p2['nl_query'].value_counts()
len(batch4nlq)

313

In [124]:
l

In [127]:
ls = batch1nlq.tolist()+batch2nlq.tolist()+batch3nlq.tolist()+batch4nlq.tolist()
df = pd.DataFrame(index = ls)
#df = pd.merge(df, ty[['nl_query','error_classification']],left_index=True, right_on="nl_query", how = "left")
len(df)
df

451

In [139]:
#df.to_csv("m1_nlqs.csv", index = True)

In [138]:
d = pd.merge(df,nlq1,left_index = True, right_on = '0', how= "outer")
d

                                                     0
343  What procedures cost less than 5000 and have J...
141              HOw many engineers are older than 30?
150  What are the first names for all faculty profe...
337  Compute the mean price of procedures physician...
42         How many games are played for all students?
..                                                 ...
247  Who are the top 3 players in terms of overall ...
237  Find the average millisecond length of Latin a...
281  What are the countries that have never partici...
50                 How many employees live in Georgia?
388  What are the names of courses that give either...

[451 rows x 1 columns]

In [48]:
313+(46*3)

451

In [41]:
len(batch2nlq[batch2nlq.nl_query.duplicated() == True])
len(batch2nlq)

AttributeError: 'numpy.ndarray' object has no attribute 'nl_query'

In [ ]:
col = 'ID'
cols_to_replace = ['Latitude', 'Longitude']
df3.loc[df3[col].isin(df1[col]), cols_to_replace] = df1.loc[df1[col].isin(df3[col]),cols_to_replace].values